#**Pandas**
* Data analysis and data handling
  * Read data
  * Clean data
  * Statistics of data
* It is built on top of NumPy
---
**Main data structures**
* Series: array with labeled index
* Dataframe: matrix with labeled index and columns

##Series

In [2]:
# importar as libs que vou usar 
import numpy as np
import pandas as pd

In [3]:
# criando uma array aleatória com um determinado intervalo (5 a 50) e ela terá 3 elementos
arr = np.random.randint(5, 50, 3)
arr

array([40, 28, 19])

In [4]:
# criando uma series. Para criar basta usar a função pd.Series(nome_da_array)
series = pd.Series(arr)
series

0    40
1    28
2    19
dtype: int64

In [5]:
# quero rotular, indexar a minha series 
# crio uma lista com os nomes dos rótulos e vou atribuí-la a uma variável
labels = ['a', 'b', 'c']
# para os rótulos entrarem em ação,eu vou vou usar a pd.Series mas dessa vez vou inserir os rótulos no parametro de entrada
# pd.Series(nome_da_array, nome_do_rótulo)
series = pd.Series(arr, labels)
series

a    40
b    28
c    19
dtype: int64

In [6]:
# quero ver quem tá em uma posição, informando o index
# nome_da_serie[nome_do_index]
series['a']

40

In [7]:
# crio uma lista com estados
states = ['CE', 'RN', 'PI', 'MA']
# crio uma matriz aleatória entre 100 e 500 com 4 elementos
sales_per_state1 = np.random.randint(100, 500, 4)
sales_per_state1

array([242, 321, 384, 448])

In [8]:
# crio uma segunda matriz aleatória entre 100 e 500 com 4 elementos
sales_per_state2 = np.random.randint(100, 500, 4)
sales_per_state2

array([219, 231, 413, 204])

In [9]:
# vou criar a minha serie 1 agora. 
#pd.Series(nome_da_matriz, rótulo (que será a lista que criamos anteriormente))
series_sales1 = pd.Series(sales_per_state1, states)
series_sales1

CE    242
RN    321
PI    384
MA    448
dtype: int64

In [10]:
# vou criar a minha serie 1 agora. 
#pd.Series(nome_da_matriz, rótulo (que será a lista que criamos anteriormente))
series_sales2 = pd.Series(sales_per_state2, states)
series_sales2

CE    219
RN    231
PI    413
MA    204
dtype: int64

In [11]:
# quero ver quem está no rótulo/index MA
series_sales1['MA']

448

In [12]:
# quero ver quem está na posição 1
series_sales2[1]

231

In [13]:
# quero somar as séries. aqui ela vai somar 1 por 1, daquele jeito 
series_sales1 + series_sales2

CE    461
RN    552
PI    797
MA    652
dtype: int64

In [14]:
# quero criar uma series a partir de um dicionário
# aqui é só: dic = {'rótulo': value, 'rótulo': value ... etc.}
dic = {'CE': 100, 'RN': 150, 'MA': 120}
dic

{'CE': 100, 'RN': 150, 'MA': 120}

In [15]:
# e ai pra gente ter a series de fato a partir do dicionário que a gente criou, nós devemos obvio contruir como de costume
# mas vai ter uma leve diferençazinha
# pd.Series(dicionário)
# ele só precisará receber como parametro o dicionário que você criou
series = pd.Series(dic)
series

CE    100
RN    150
MA    120
dtype: int64

##Dataframes

In [16]:
# criando as listas que servirão para as columns e index
columns = ['W', 'X', 'Y', 'Z']
index = ['A', 'B', 'C']

# criando uma array aleatória entre -100 e 100 com shape(3,4)
arr = np.random.randint(-100, 100, (3, 4))
arr

array([[-14, -48, -55,  37],
       [-22,  28,  29, -89],
       [-18, -65,  19, -35]])

In [17]:
# agora iremos criar um dataframe
# pd.Dataframe(nome_da_array, rótulos, nome_das_colunas)
data_frame1 = pd.DataFrame(arr, index, columns)
data_frame1

    W   X   Y   Z
A -14 -48 -55  37
B -22  28  29 -89
C -18 -65  19 -35

In [18]:
# quero saber o tipo do df
# type(df)
type(data_frame1)

pandas.core.frame.DataFrame

In [19]:
# quero mostrar quem está no coluna X do df
data_frame1['X']

A   -48
B    28
C   -65
Name: X, dtype: int64

In [20]:
# tipo da coluna X do df
type(data_frame1['X'])

pandas.core.series.Series

In [21]:
# quero exibir as colunas Y e W do df
# df[['col', 'col']]
data_frame1[['Y', 'W']]

    Y   W
A -55 -14
B  29 -22
C  19 -18

In [22]:
# quero informações sobre o df, média, desvio padrão, quantidade etc.
# df.describe() vai atender a sua necessidade
data_frame1.describe()

          W          X          Y          Z
count   3.0   3.000000   3.000000   3.000000
mean  -18.0 -28.333333  -2.333333 -29.000000
std     4.0  49.521039  45.883911  63.213923
min   -22.0 -65.000000 -55.000000 -89.000000
25%   -20.0 -56.500000 -18.000000 -62.000000
50%   -18.0 -48.000000  19.000000 -35.000000
75%   -16.0 -10.000000  24.000000   1.000000
max   -14.0  28.000000  29.000000  37.000000

In [23]:
# quero criar uma coluna nova através de algumas que eu já tenho
# é só somar ou fazer o que você quiser marcando as labels
data_frame1['V'] = data_frame1['X'] + data_frame1['Z']
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [24]:
# quero as colunas do df
# df.columns
data_frame1.columns

Index(['W', 'X', 'Y', 'Z', 'V'], dtype='object')

In [25]:
# quero os index do df
# df.index
data_frame1.index

Index(['A', 'B', 'C'], dtype='object')

In [26]:
# quero excluir determinado indice do df, no nosso caso eu escolhi o B
# df.drop('o que eu quero excluir')
data_frame1.drop('B')

    W   X   Y   Z    V
A -14 -48 -55  37  -11
C -18 -65  19 -35 -100

In [27]:
# mostrando o df de novo
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [28]:
# quero excluir colunas?
# df.drop('nome da col que quero excluir', axis=1)
data_frame1.drop('W', axis=1)

    X   Y   Z    V
A -48 -55  37  -11
B  28  29 -89  -61
C -65  19 -35 -100

In [29]:
# quero pegar a forma do df
# df.shape
data_frame1.shape

(3, 5)

In [30]:
# mostrando o df de novo
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [31]:
# quero saber o que há na localização A, ou seja, nessa linha.
#df.loc['onde eu quero saber']
data_frame1.loc['A']   # localization

W   -14
X   -48
Y   -55
Z    37
V   -11
Name: A, dtype: int64

In [32]:
# posso pegar mais de uma localização se eu quiser
data_frame1.loc[['C', 'A']]

    W   X   Y   Z    V
C -18 -65  19 -35 -100
A -14 -48 -55  37  -11

In [33]:
# aqui é se eu quiser passar o número da posição, ao invés da posição de fato, o nome dela.
# para isto, ao invés de loc, usamos o iloc
# df.iloc[número da posição]
data_frame1.iloc[1]

W   -22
X    28
Y    29
Z   -89
V   -61
Name: B, dtype: int64

In [34]:
# posso pegar algum elemento através de suas coordenadas
# para isso o iloc ainda atende
# df.iloc[linha, coluna]
data_frame1.iloc[1, 2]

29

In [35]:
# aqui é se eu quiser ver a localização informando os index e colunas, tipo casando naquele formato  
data_frame1.loc[['C', 'A'], ['V', 'X']]

     V   X
C -100 -65
A  -11 -48

In [36]:
# quero ver quem tá na coluna x
data_frame1['X']

A   -48
B    28
C   -65
Name: X, dtype: int64

In [37]:
# quero ver quem na coluna x do df é maior que 0
data_frame1['X'] > 0

A    False
B     True
C    False
Name: X, dtype: bool

In [38]:
# da mesma for que a anterior, mas isto vira uma condição dentro da localizaão
# como assim? quero exibição de gente da coluna x do df que é maior que 0
data_frame1[data_frame1['X'] > 0]

    W   X   Y   Z   V
B -22  28  29 -89 -61

In [39]:
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [40]:
# autoexplicativo. Cansei de digitar as mesmas coisas kkkkkk. 
# brincandeira kkkk
# aqui a gente tem o seguinte: quero exibir quem do meu df da coluna x tem value>0 e de acordo com a linha dele
# pegar o elemento da coluna W

data_frame1[data_frame1['X'] > 0]['W']

B   -22
Name: W, dtype: int64

In [41]:
# DA MESMA FORMA DA CÉLULA ANTERIOR, A DIFERENÇA É QUE AGORA EU QUERO DE DUAS COLUNAS: W E V
data_frame1[data_frame1['X'] > 0][['W', 'V']]

    W   V
B -22 -61

In [42]:
# quero exibir quem tá na minha coluna W e no index A
data_frame1['W']['A']

-14

In [43]:
# exibe o df de novo
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [44]:
# usando operadores lógicos para ver algumas condições conjuntas
# quem da coluna x é maior que 0 e da coluna V maior que 0?
(data_frame1['X'] > 0) & (data_frame1['V'] > 0)

A    False
B    False
C    False
dtype: bool

In [45]:
# quero ver agora quem do df atende as duas condições
data_frame1[(data_frame1['X'] > 0) & (data_frame1['V'] > 0)]

Empty DataFrame
Columns: [W, X, Y, Z, V]
Index: []

In [46]:
data_frame1

    W   X   Y   Z    V
A -14 -48 -55  37  -11
B -22  28  29 -89  -61
C -18 -65  19 -35 -100

In [47]:
# quero ver agora quem tem um OU ouro
# | --> OU 
(data_frame1['X'] > 0) | (data_frame1['V'] > 0)

A    False
B     True
C    False
dtype: bool

In [48]:
# quero ver as informações do meu df. Isso serve por exemplo, pra ver se há algo vazio, sem nada no meu df
data_frame1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 5 columns):
W    3 non-null int64
X    3 non-null int64
Y    3 non-null int64
Z    3 non-null int64
V    3 non-null int64
dtypes: int64(5)
memory usage: 224.0+ bytes

##Data Input

In [49]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [52]:
cd home/

[Errno 2] No such file or directory: 'home/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [53]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [54]:
cd vivi/

[Errno 2] No such file or directory: 'vivi/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [55]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [56]:
cd Documents/

[Errno 2] No such file or directory: 'Documents/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [57]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [58]:
cd HCIA_AI_HUAWEI/

[Errno 2] No such file or directory: 'HCIA_AI_HUAWEI/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [59]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [60]:
cd week1/

[Errno 2] No such file or directory: 'week1/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [61]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [62]:
cd lecture4_2304/

[Errno 2] No such file or directory: 'lecture4_2304/'
/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304

In [63]:
ls

 african_econ_crises.csv  'Lab 03 - Exercises - Pandas.ipynb'
'all about Pandas.ipynb'  'Lab 03 - Introduction_to_Pandas.ipynb'
 dataset_bank.csv         'Lecture 03 - AI Disputes and Future Prospects.pdf'

In [65]:
# quero fazer a leitura do meu arquivo csv
#para fazer a leitura de algum arquivo csv: pd.read_csv('caminho ou nome do arquivo')

data_bank = pd.read_csv('/home/vivi/Documents/HCIA_AI_HUAWEI/week1/lecture4_2304/dataset_bank.csv')
data_bank

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

**Data Set Information**: https://archive.ics.uci.edu/ml/datasets/bank+marketing

In [66]:
# quero mostrar os 5 primeiros casos(linhas)
# nome_do_dataset.head(se você deixar aqui vazio, automaticamente irá ser mostrado 5. Se quer outro número, bote o número)

data_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [190]:
# como já explicado na célula anterior
data_bank.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

In [67]:
# agora eu n quero ver os primeiros, quero ver os últimos.
# nome_do_dataset.tail(se deixar aqui vazio, será mostrado os 5 últimos casos(linhas))
# se quiser ver os 10 últimos por exemplo: data_bank.tail(10)
data_bank.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [68]:
# é tipo: quais são as classes de marital? Quais variáveis tenho em marital? tipo isso.
#nome_do_dataset['coluna que eu quero'].unique()
data_bank['marital'].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [69]:
# agora eu quero ver as variáveis que existem na coluna job
#nome_do_dataset['coluna que eu quero ver'].unique()
data_bank['job'].unique()

array(['unemployed', 'services', 'management', 'blue-collar',
       'self-employed', 'technician', 'entrepreneur', 'admin.', 'student',
       'housemaid', 'retired', 'unknown'], dtype=object)

In [70]:
# anteriormente eu vi as variáveis que existem na coluna job, o nome de todas elas, mas agora eu quero ver o número
# dessas variáveis, a quantidade e para isso, basta eu utilizar a função nunique()
# nome_do_dataset['coluna que eu quero'].nunique()

data_bank['job'].nunique()

12

In [71]:
# aqui eu quero que seja exibido todos da coluna job que possuam a variável "student"
# é só botar a condição dentro do parênteses
data_bank[data_bank['job']=='student']

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
13,20,student,single,secondary,no,502,no,no,cellular,30,apr,261,1,-1,0,unknown,yes
110,21,student,single,secondary,no,2488,no,no,cellular,30,jun,258,6,169,3,success,yes
114,25,student,single,secondary,no,331,no,no,telephone,26,aug,170,4,-1,0,unknown,yes
194,23,student,single,secondary,no,9216,no,no,cellular,5,jun,471,2,-1,0,unknown,no
234,30,student,single,secondary,no,3096,no,no,cellular,26,jan,123,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4214,36,student,single,unknown,no,386,no,no,unknown,18,jun,359,2,-1,0,unknown,no
4263,25,student,married,tertiary,no,10,yes,no,cellular,21,jul,857,4,-1,0,unknown,yes
4332,27,student,single,secondary,no,8366,no,no,cellular,7,may,458,2,349,1,other,no
4439,28,student,single,secondary,no,330,no,no,telephone,2,feb,197,1,-1,0,unknown,no
4446,22,student,single,secondary,no,246,yes,no,telephone,12,may,25,1,-1,0,unknown,no

In [73]:
# agora a quantidade utilizando a função count()
# aqui ele vai me retornar a quantidade de student em cada coluna/característica do caso/linha
data_bank[data_bank['job']=='student'].count()

age          84
job          84
marital      84
education    84
default      84
balance      84
housing      84
loan         84
contact      84
day          84
month        84
duration     84
campaign     84
pdays        84
previous     84
poutcome     84
y            84
dtype: int64

In [74]:
# pegando o shape do dataset com a minha condição
data_bank[data_bank['job']=='student'].shape

(84, 17)

In [75]:
# pegando as informações do dataset
# nome_do_dataset.info()
data_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4521 non-null object
marital      4521 non-null object
education    4521 non-null object
default      4521 non-null object
balance      4521 non-null int64
housing      4521 non-null object
loan         4521 non-null object
contact      4521 non-null object
day          4521 non-null int64
month        4521 non-null object
duration     4521 non-null int64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4521 non-null object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [76]:
# aqui eu quero a média de cada coluna por educação
data_bank.groupby('education').mean()

,age,balance,day,duration,campaign,pdays,previous
education,,,,,,,
primary,46.833333,1411.544248,15.505900,261.709440,2.865782,35.069322,0.460177
secondary,40.062446,1196.814397,15.977884,269.863833,2.734172,40.934085,0.528621
tertiary,39.645926,1775.423704,16.009630,256.881481,2.901481,39.824444,0.612593
unknown,45.299465,1701.245989,15.946524,250.449198,2.486631,41.983957,0.508021

In [77]:
# aqui eu tô agrupando a coluna education, tirando a média do que está localizado em tertiary que é uma das variáveis de education
data_bank.groupby('education').mean().loc['tertiary']

age           39.645926
balance     1775.423704
day           16.009630
duration     256.881481
campaign       2.901481
pdays         39.824444
previous       0.612593
Name: tertiary, dtype: float64

In [78]:
# aqui eu agrupei só quem está em education, tirei a média para cada característica de cada variável de education
# e organizei (sort_values) a coluna balance do menor para o maior
data_bank.groupby('education').mean().sort_values('balance')

,age,balance,day,duration,campaign,pdays,previous
education,,,,,,,
secondary,40.062446,1196.814397,15.977884,269.863833,2.734172,40.934085,0.528621
primary,46.833333,1411.544248,15.505900,261.709440,2.865782,35.069322,0.460177
unknown,45.299465,1701.245989,15.946524,250.449198,2.486631,41.983957,0.508021
tertiary,39.645926,1775.423704,16.009630,256.881481,2.901481,39.824444,0.612593

In [79]:
# aqui eu agrupei só quem está em education, tirei a média para cada característica de cada variável desse grupo e
# dessa vez peguei a coluna balance e a coloquei do número maior para o menor (consigo fazer isso introduzindo o
# argumento "ascendinh=False". Se o lugar desse argumento estiver vazio, a coluna vai ficar do menor para o maior
# automaticamente)
data_bank.groupby('education').mean().sort_values('balance', ascending=False)

,age,balance,day,duration,campaign,pdays,previous
education,,,,,,,
tertiary,39.645926,1775.423704,16.009630,256.881481,2.901481,39.824444,0.612593
unknown,45.299465,1701.245989,15.946524,250.449198,2.486631,41.983957,0.508021
primary,46.833333,1411.544248,15.505900,261.709440,2.865782,35.069322,0.460177
secondary,40.062446,1196.814397,15.977884,269.863833,2.734172,40.934085,0.528621

In [80]:
# fiz as mesmas coisas das células anteriores, vou explicar de novo n ó
data_bank.groupby('education').mean().sort_values('balance', ascending=False).sort_values('age')

,age,balance,day,duration,campaign,pdays,previous
education,,,,,,,
tertiary,39.645926,1775.423704,16.009630,256.881481,2.901481,39.824444,0.612593
secondary,40.062446,1196.814397,15.977884,269.863833,2.734172,40.934085,0.528621
unknown,45.299465,1701.245989,15.946524,250.449198,2.486631,41.983957,0.508021
primary,46.833333,1411.544248,15.505900,261.709440,2.865782,35.069322,0.460177

In [81]:
# vendo os 5 primeiros casos/linhas do dataset
data_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [82]:
# quero a média de cada marital dentro de cada education. essa média será de cada coluna
data_bank.groupby(['education', 'marital']).mean()

                          age      balance        day    duration  campaign  \
education marital
primary   divorced  51.392405  1072.721519  14.544304  361.202532  2.481013
          married   47.511407  1371.638783  15.437262  243.414449  2.908745
          single    37.013699  2065.753425  17.041096  285.863014  2.972603
secondary divorced  43.496296   891.181481  15.733333  258.237037  2.581481
          married   42.404345  1272.911002  16.173090  260.746321  2.827610
          single    33.052545  1154.008210  15.628900  296.382594  2.582923
tertiary  divorced  45.148387  1437.896774  15.935484  274.658065  2.767742
          married   41.777166  1860.719395  15.751032  256.752407  2.916094
          single    34.512821  1754.711538  16.435897  251.194444  2.923077
unknown   divorced  50.375000  1849.333333  18.791667  275.166667  2.208333
          married   48.444444  1725.547009  15.717949  262.658120  2.384615
          single    34.652174  1562.173913  15.043478  206.500000  2.891304

                        pdays  previous
education marital
primary   divorced  33.987342  0.417722
          married   35.351711  0.484791
          single    34.205479  0.328767
secondary divorced  37.914815  0.422222
          married   39.652418  0.517870
          single    45.275862  0.600985
tertiary  divorced  42.122581  0.509677
          married   36.764787  0.555708
          single    43.816239  0.735043
unknown   divorced  43.750000  0.250000
          married   48.589744  0.461538
          single    24.260870  0.760870

#One Hot Encoding

In [83]:
# vendo as 5 primeiras linhas/casos do dataset de novo
data_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [84]:
# quero ver as possibilidades existentes de marital no dataset
data_bank['marital'].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [85]:
# aqui vai ser o seguinte: vou usar o get_dumies para ver qual a opção de marital para cada linha
# por exemplo: a linha/caso zero é divorced,married ou single? é married, portanto terá 1 na coluna married e 0
# no restante
# pd.get_dumies(nome_do_dataset['coluna que eu quero ver'])
pd.get_dummies(data_bank['marital'])

      divorced  married  single
0            0        1       0
1            0        1       0
2            0        0       1
3            0        1       0
4            0        1       0
...        ...      ...     ...
4516         0        1       0
4517         0        1       0
4518         0        1       0
4519         0        1       0
4520         0        0       1

[4521 rows x 3 columns]

In [89]:
# aqui eu quero concatenar o dataset normal com os meus get_dumies do marital que eu vi anteriormente, 
# as colunas, no caso (axis=1)
# quero salvar isso em um novo dataset (o data2)
data2 = pd.concat([data_bank, pd.get_dummies(data_bank['marital'])], axis=1)
data2

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,divorced,married,single
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,1,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,1,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,0,1
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,1,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no,0,1,0
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no,0,1,0
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no,0,1,0
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no,0,1,0
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no,0,0,1

In [97]:
# quero tirar a coluna marital
# nome_do_dataset.drop('nome_da_coluna', axis=1)
data2.drop('marital', axis=1)

,age,job,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,divorced,married,single
0,30,unemployed,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,1,0
1,33,services,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,1,0
2,35,management,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,0,1
3,30,management,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,1,0
4,59,blue-collar,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no,0,1,0
4517,57,self-employed,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no,0,1,0
4518,57,technician,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no,0,1,0
4519,28,blue-collar,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no,0,1,0
4520,44,entrepreneur,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no,0,0,1

In [98]:
# tô colocando valores do maior para o menor em duas colunas ao mesmo tempo
data_bank.sort_values(['age', 'balance'], ascending=[False, False])

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
3311,87,retired,married,primary,no,230,no,no,cellular,30,oct,144,1,-1,0,unknown,yes
1866,86,retired,married,secondary,no,1503,no,no,telephone,18,mar,165,3,101,1,other,no
4108,84,retired,divorced,primary,no,639,no,no,telephone,18,may,353,3,-1,0,unknown,yes
4388,83,retired,divorced,primary,no,1097,no,no,telephone,5,mar,181,1,-1,0,unknown,yes
1349,83,retired,married,primary,no,425,no,no,telephone,22,jun,883,1,140,1,failure,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999,20,student,single,secondary,no,291,no,no,telephone,11,may,172,5,371,5,failure,no
3233,19,student,single,unknown,no,1169,no,no,cellular,6,feb,463,18,-1,0,unknown,no
2780,19,student,single,secondary,no,302,no,no,cellular,16,jul,205,1,-1,0,unknown,yes
503,19,student,single,primary,no,103,no,no,cellular,10,jul,104,2,-1,0,unknown,yes
1900,19,student,single,unknown,no,0,no,no,cellular,11,feb,123,3,-1,0,unknown,no